start_text = (
    "Привет, {user_name}! 👋\n\n"
    "- Этот бот поможет тебе быстро и просто шифровать и расшифровывать сообщения 🔒.\n"
    "- Отправь любой текст — бот зашифрует его для тебя 🔑.\n"
    "- После шифровки бот выдаст ключ для расшифровки, без ключа невозможно вернуть исходное сообщение 🔐.\n"
    "- Ты можешь выбрать один из трёх уровней сложности пароля для защиты ⚙️.\n"
    "- Для списка команд напиши /help."
)

help_text = (
    "📖 *Помощь по боту*\n\n"
    "🔐 Для *шифровки* используй команду /encrypt и отправь сообщение — бот зашифрует его и выдаст ключ. "
    "Не теряй ключ, он нужен для расшифровки!\n\n"
    "🗝️ Для *расшифровки* используй команду /decrypt, затем введи ключ и зашифрованный текст — бот вернёт исходное сообщение.\n\n"
    "💻 Команда /github — ссылка на мой GitHub с исходным кодом бота.\n\n"
    "🧹 После выполнения шифровки или расшифровки очищай чат с ботом, чтобы удалить ключи и исходные тексты из переписки."
)

github_link_text = "🔗 Репозиторий проекта: https://github.com/Finni-py/IP-Tracker"
